/*--------------------------------------------------------------------*/
/*  Copyright(C) 2007-2007 by OMRON Corporation                       */
/*  All Rights Reserved.                                              */
/*--------------------------------------------------------------------*/
/*
	更新履歴：
	------------------------------------------------------------------------------
	年月日		更新内容				備考
	07-01-25	新規作成				SDK Ver4 対応
	------------------------------------------------------------------------------
*/

#ifndef	MODEFR_H__
#define	MODEFR_H__

#include	"CommonDef.h"

#define USER_ID_LENGTH 16			/* 個人識別ＩＤの長さ */
typedef unsigned char FR_USER_ID;	/* 個人識別ＩＤ（16バイトで1つのＩＤ） */

/* データ作成モード */
enum FR_MODE {
	FR_MODE_DEFAULT = 0				/* デフォルト(標準) */
};

#endif	/* MODEFR_H__ */
